dic = dict()
c = [['Дамблдор А.А.', 'Защитаоттемныхискусств', '14'], ['Локонс Б.И.', 'Защитаоттемныхискусств', '1'], ['Люпин К.Б.', 'Защитаоттемныхискусств', '2'], ['Квиррел К.Н.', 'Защитаоттемныхискусств','3'], ['МакГонагалл М.В.', 'Трансфигурация', '4'], ['Снегг С.С.', 'Зельеварение', '5'], ['Вектор Е.С.', 'Астрономия', '6'], ['Спраут Е.Ф.', 'Травология', '7'], ['Флитвик Ф.Ф.', 'Заклинания', '8'], ['Снегг С.С.', 'Защитаоттемныхискусств', '9'], ['Дамблдор А.А.', 'Трансфигурация', '10'], ['Слизнорт Г.И.', 'Зельеварение', '11'], ['Трюк М.А.', 'Полетынаметле', '12'], ['Трелони А.И.', 'Прорицания', '13']]
name = []
sub = []
id = []
for i in c:
    print(i[2])
    id.append(int(i[2]))
    sub.append(i[1])
    name.append(i[0])
dic['name']=name
dic['subject'] = sub
dic['id_s_t'] = id
print(dic)
